cases/chpt4-Ga-three-phase/0/A
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      A;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
      type   zeroGradient;
//      type   fixedValue;
//      value uniform (0 0 0);
      // Bizare!!
//      type   fixedGradient;
//      gradient (1 1 1);
    }
    btm
    {
      type   zeroGradient;
//      value uniform (0 0 0);
//      type   fixedGradient;
//      gradient (1 1 1);
    }
    hotTop
    {
        type            zeroGradient;
    }
    coldTop
    {
        type            zeroGradient;
    }
    hot
    {
        type            zeroGradient;
    }
    cold
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}           

// ************************************************************************* //
