cases/chpt4-Ga-three-phase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 301.3;//45; // 28.3 C

boundaryField
{
    hot
    {
      type   fixedValue;
        value uniform 311;//.15;
    } 
    btm
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    cold
    {
        type           inletOutlet;
        inletValue     uniform 301.3;//$internalField;
        value          uniform 301.3;//$internalField;
    }
    top
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    hotTop
    {
//      type   zeroGradient;
        $hot;
    }
    coldTop
    {
//      type   zeroGradient;
        $top;
    }
    frontAndBack
    {
        type empty;
    }
}           

// ************************************************************************* //
