cases/chpt4-Ga-three-phase/0/alpha.Phase3.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.Phase3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    hotTop
    {
        type            zeroGradient;
    }
    coldTop
    {
        type            zeroGradient;
    }
    hot
    {
        type            zeroGradient;
    }
    cold
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    btm
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}