cases/chpt4-Ga-three-phase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    hot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       11773;
    }
    hotTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7;
        startFace       11837;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       11844;
    }
    coldTop
    {
        type            patch;
        nFaces          7;
        startFace       11908;
    }
    top
    {
        type            patch;
        nFaces          84;
        startFace       11915;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       11999;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11928;
        startFace       12083;
    }
)

// ************************************************************************* //
