cases/chpt4-Ga-three-phase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.Phase1 0
    volScalarFieldValue alpha.Phase2 0
    volScalarFieldValue alpha.Phase3 1
//    volScalarFieldValue T 305   
    /*
    volScalarFieldValue alpha1 0
    volScalarFieldValue alpha2 0
    volScalarFieldValue alpha3 1
    */
);

regions
(
/*
    boxToCell
    {
        box (0.001 -3 0) (1 3 0.0635);
        fieldValues
        (
            volScalarFieldValue alpha.Phase1 0
            volScalarFieldValue alpha.Phase2 0
            volScalarFieldValue alpha.Phase3 1
            volScalarFieldValue T 301.3
        );
    }
*/
    boxToCell
    {
//        box (0 -3 0.0635) (0.0889 3 0.1035);

        box (0 -3 0.0635) (1 3 0.1035);
        fieldValues
        (
            /*
            volScalarFieldValue alpha1 1
            volScalarFieldValue alpha2 0
            volScalarFieldValue alpha3 0
            */
            volScalarFieldValue alpha.Phase1 1
            volScalarFieldValue alpha.Phase2 0
            volScalarFieldValue alpha.Phase3 0
        );
    }
    /*
    boxToCell
    {
        box (0 -3 0) (0.0889 3 0.02);
        fieldValues
        (
            volScalarFieldValue alpha.Phase1 0
            volScalarFieldValue alpha.Phase2 0
            volScalarFieldValue alpha.Phase3 1
        );
    }
    */
);


// ************************************************************************* //
